
public class AlphInfo {
	
	String[][] alph = {
						{"A","1","臺北市"}, {"B","0","臺中市"}, {"C","9","基隆市"}, {"D","8","台南市"}, {"E","7","高雄市"},
						{"F","6","新北市"}, {"G","5","宜蘭縣"}, {"H","4","桃園市"}, {"I","9","嘉義市"}, {"J","3","新竹縣"},
						{"K","2","苗栗縣"}, {"L","2","臺中市"}, {"M","1","南投縣"}, {"N","0","彰化縣"}, {"O","8","新竹市"},
						{"P","9","雲林縣"}, {"Q","8","嘉義縣"}, {"R","7","臺南市"}, {"S","6","高雄市"}, {"T","5","屏東縣"},
						{"U","4","花蓮縣"}, {"V","3","臺東縣"}, {"W","1","金門縣"}, {"X","3","澎湖縣"}, {"Y","2","臺北市"},
						{"Z","0","連江縣"}	// L臺中縣 R臺南縣 S高雄縣 Y陽明山管理局	
						};
	int[] r = {8, 7, 6, 5, 4, 3, 2, 1, 1};
	int alphNum(String alph) {
		char c = alph.charAt(0);
		c -= 65;
		return Integer.parseInt((this.alph[(int)c][1]));
	}

}
